tutorials/heatTransfer/buoyantSimpleFoam/circuitBoardCooling/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

restore0Dir

# Create 1D and 3D baffles
runApplication createBaffles -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
